/*
    a ???
    ul
        li
            a
                div
                    span -> image
                span -> text
*/

/* 
    menu: кнопка + ul + функція, яка перебере menu1 i menu2 з config, відміряє потрібну кількість елементів і створить...
        ... необхідну кількість елементів menuElements
    menuElement: li + a + div->spanImage + spanText
 */

/*
menuElement {
    - шаблон для всіх елементів меню
    - дані підтягувати з інших файлів
        - зробити 2 масиви з іменами, посиланнями і координатами для спрайту, по одному на кожну частину меню
        - зображення підтягувати зі спрайту
}
*/